Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: The spaces are not occupied as resident sleeping rooms, treatment rooms, incidental uses in accordance with Section 509, or hazardous uses.
fr_ca: Les espaces ne doivent pas être occupés comme chambres des résidents, salles de traitement, usages accessoires conformément à la section 509 ou usages dangereux.

source: The sprinkler system shall be designed so that the entire surface of the glass is wet upon activation of the sprinkler system without obstruction;
fr_ca: Le système de gicleurs doit être conçu de manière que toute la surface du verre soit mouillée lors du déclenchement du système de gicleurs, sans obstruction;

source: The sprinklers shall be located between 4 inches and 12 inches (102 mm and 305 mm) away from the glass and at intervals along the glass not greater than 6 feet (1829 mm).
fr_ca: Les gicleurs doivent être situés à une distance de 4 po à 12 po (102 mm à 305 mm) du verre et espacés d’au plus 6 pi (1 829 mm) le long du verre.

source: The stage shall be separated from dressing rooms, scene docks, property rooms, workshops, storerooms and compartments appurtenant to the stage and other parts of the building by fire barriers constructed in accordance with Section 707 or horizontal assemblies constructed in accordance with Section 711, or both.
fr_ca: La scène doit être séparée des loges, des quais de scène, des locaux à accessoires, des ateliers, des réserves et des locaux annexes à la scène, ainsi que des autres parties du bâtiment, par des séparations coupe-feu construites conformément à la section 707 ou par des assemblages horizontaux construits conformément à la section 711, ou par les deux.

source: The stop work order shall be in writing and shall be given to the owner of the property, the owner's authorized agent or the person performing the work.
fr_ca: L’ordre d’arrêt des travaux doit être donné par écrit au propriétaire du bien, au mandataire autorisé du propriétaire ou à la personne qui effectue les travaux.

source: The stop work order shall state the reason for the order and the conditions under which the cited work is authorized to resume.
fr_ca: L’ordre d’arrêt des travaux doit indiquer le motif de l’ordre et les conditions dans lesquelles les travaux visés sont autorisés à reprendre.

source: The stopping of leaks in drains, water, soil, waste or vent pipe, provided, however, that if any concealed trap, drain pipe, water, soil, waste or vent pipe becomes defective and it becomes necessary to remove and replace the same with new material, such work shall be considered as new work and a permit shall be obtained and inspection made as provided in this code.
fr_ca: L’arrêt des fuites dans les drains, les conduites d’eau, les conduites d’eaux vannes, les conduites d’eaux usées ou les conduites d’évent, à condition toutefois que, si un siphon dissimulé, un tuyau de drainage, une conduite d’eau, une conduite d’eaux vannes, une conduite d’eaux usées ou une conduite d’évent devient défectueux et qu’il est nécessaire de le retirer et de le remplacer par du matériel neuf, ces travaux soient considérés comme de nouveaux travaux et qu’un permis soit obtenu et qu’une inspection soit effectuée conformément au présent code.

source: The stripe shall be placed on the top surface of the handrail for the entire length of the handrail, including extensions and newel post caps.
fr_ca: La bande doit être placée sur la surface supérieure de la main courante sur toute la longueur de la main courante, y compris les prolongements et les chapeaux de poteau.

source: The stripes shall be 1 to 2 inches (25 mm to 51 mm) wide with interruptions not exceeding 4 inches (102 mm).
fr_ca: Les bandes doivent avoir une largeur de 1 à 2 po (25 mm à 51 mm) avec des interruptions ne dépassant pas 4 po (102 mm).

source: The stroke width shall be 10 percent minimum and 30 percent maximum of the height of the uppercase “I” of the font.
fr_ca: La largeur de trait doit être comprise entre 10 pour cent minimum et 30 pour cent maximum de la hauteur du « I » majuscule de la police.

source: The supporting construction shall be protected to afford the required fire-resistance rating of the horizontal assembly supported.
fr_ca: Les éléments porteurs doivent être protégés de manière à assurer le degré de résistance au feu requis de l'ensemble horizontal supporté.

source: The supporting construction shall be protected to afford the required fire-resistance rating of the wall or floor supported in buildings of other than Type IIB, IIIB or VB construction.
fr_ca: La construction porteuse doit être protégée de manière à assurer la résistance au feu requise pour le mur ou le plancher qu’elle supporte dans les bâtiments autres que ceux de type IIB, IIIB ou VB.

source: The supporting documentation shall fully describe the exterior wall system that was tested, where applicable, as well as the test procedure used.
fr_ca: Les documents justificatifs doivent décrire en détail le système de murs extérieurs qui a fait l’objet de l’essai, le cas échéant, ainsi que la procédure d’essai utilisée.

source: The surface for stepped aisles shall comply with Section 1011.7.1.
fr_ca: La surface des allées à marches doit être conforme à la section 1011.7.1.

source: The surface of aisles, stepped aisles and ramped aisles shall be of slip-resistant materials that are securely attached.
fr_ca: La surface des allées, des allées à gradins et des allées en rampe doit être faite de matériaux antidérapants solidement fixés.

source: The surface of ramps shall be of slip-resistant materials that are securely attached.
fr_ca: La surface des rampes doit être faite de matériaux antidérapants solidement fixés.

source: The symbol shall be not less than 3 inches (76 mm) in height and shall be placed inside on both sides of the hoistway door frame.
fr_ca: Le symbole doit avoir une hauteur d'au moins 3 po (76 mm) et doit être placé à l'intérieur, des deux côtés du cadre de la porte du puits.

source: The system shall be activated in accordance with Section 907.5.
fr_ca: Le système doit être activé selon la section 907.5.

source: The system shall be capable of maintaining temperatures within the range established for the elevator equipment.
fr_ca: Le système doit être capable de maintenir les températures dans la plage établie pour l'équipement de l'ascenseur.

source: The system shall be installed as tested and in accordance with the manufacturer's installation instructions, and shall have a rating of not less than 2 hours.
fr_ca: Le système doit être installé conformément aux résultats de l’essai et aux instructions d’installation du fabricant, et son degré de résistance au feu doit être d’au moins 2 heures.

source: The table is based on the following calculation: [(2X+34)(Y-2.25)/X]+(20.2-Y) where Y is the riser height of the rows in front of the wheelchair space location and X is the tread depth of the rows in front of the wheelchair space location.
fr_ca: Le tableau est basé sur le calcul suivant : [(2X+34)(Y-2,25)/X]+(20,2-Y) où Y est la hauteur de la contremarche des rangées devant l'emplacement de l'espace pour fauteuil roulant et X est la profondeur du giron des rangées devant l'emplacement de l'espace pour fauteuil roulant.

source: The telephone and emergency signaling device shall comply with Section 309.3 and 309.4.
fr_ca: Le téléphone et le dispositif de signalisation d'urgence doivent être conformes aux sections 309.3 et 309.4.

source: The telephone cord shall be 29 inches (735 mm) minimum in length.
fr_ca: Le cordon du téléphone doit avoir une longueur minimale de 29 po [735 mm].

source: The throat opening shall be not less than 4 inches (102 mm) deep.
fr_ca: L'ouverture de la goulotte ne doit pas être inférieure à 4 po (102 mm) de profondeur.

source: The throat shall be not less than 8 inches (203 mm) above the fireplace opening.
fr_ca: La goulotte ne doit pas être à moins de 8 po [203 mm] au-dessus de l'ouverture du foyer.

source: The tolerance between adjacent risers on a stepped aisle that were designed to be equal height shall not exceed 3/16 inch (4.8 mm).
fr_ca: La tolérance entre des contremarches adjacentes d’une allée à gradins qui ont été conçues pour avoir la même hauteur ne doit pas être supérieure à 3/16 po (4,8 mm).

source: The tolerance between adjacent treads shall not exceed 3/16 inch (4.8 mm).
fr_ca: La tolérance entre les girons adjacents ne doit pas excéder 3/16 po (4,8 mm).

source: The top and sides of the door frame shall be marked with a solid and continuous 1-inch-to 2-inch-wide (25 mm to 51 mm) stripe.
fr_ca: Le haut et les côtés du cadre de la porte doivent être marqués d'une bande pleine et continue de 1 à 2 pouces de large (25 à 51 mm).

source: The top of the pass-through opening is located a maximum of 48 inches (1219 mm) above the floor.
fr_ca: La partie supérieure de l'ouverture de passage est située à une hauteur maximale de 48 po [1219 mm] au-dessus du sol.

source: The top of the side rail shall extend 5 inches (127mm) minimum above the top of the changing surface.
fr_ca: Le haut de la barrière latérale doit dépasser d'au moins 5 po [127 mm] au-dessus du haut de la surface à langer.

source: The top of the water closet seat shall be 15 inches (380 mm) minimum and 19 inches (485 mm) maximum above the floor, measured to the top of the seat.
fr_ca: Le haut du siège de la cabine de toilette doit se trouver à une hauteur comprise entre 15 po [380 mm] et 19 po [485 mm] au-dessus du sol, mesurée jusqu'à la partie supérieure du siège.

source: The top rail or handrail shall be supported by not fewer than three glass baluster panels, or shall be otherwise supported to remain in place should one glass baluster panel fail.
fr_ca: Le garde-corps supérieur ou la main courante doit être soutenu par au moins trois panneaux de balustrade en verre, ou doit être soutenu d'une autre manière pour rester en place en cas de défaillance d'un panneau de balustrade en verre.

source: The top rail or handrail shall be supported by not less than three glass baluster panels, or shall be otherwise supported to remain in place should one glass baluster panel fail.
fr_ca: Le garde-corps supérieur ou la rampe doit être soutenu par au moins trois panneaux de balustrade en verre, ou il doit être soutenu d'une autre manière pour rester en place en cas de défaillance d'un panneau de balustrade en verre.

source: The top rail shall remain in place after impact
fr_ca: La rampe supérieure doit rester en place après l'impact

source: The total capacity of any combination of remaining interior exit stairways with one interior exit stairway removed shall be not less than the total capacity required by Section 1005.1.
fr_ca: La capacité totale de toute combinaison d’escaliers d’issue intérieurs restants après le retrait d’un escalier d’issue intérieur ne doit pas être inférieure à la capacité totale exigée par la section 1005.1.

source: The total minimum thickness of front, back and side walls shall be 8 inches (203 mm) of solid masonry.
fr_ca: L'épaisseur minimale totale des parois avant, arrière et latérales doit être de 8 po [203 mm] de maçonnerie pleine.

source: The total number of seats specified shall be those within the space exposed to the same smoke-protected environment.
fr_ca: Le nombre total de sièges spécifié doit être celui des sièges situés dans l'espace exposé au même environnement protégé contre la fumée.

source: The transition from 1 foot candle (10.8 lux) to 10 foot candle (108 lux) under conditions of stair use shall be permitted to be achieved by automatic, motion sensor-type lighting switches provided the switch controllers comply with all of the following:
fr_ca: La transition de 1 pied-bougie [10,8 lux] à 10 pieds-bougies [108 lux] dans des conditions d'utilisation de l'escalier peut être réalisée par des interrupteurs d'éclairage automatiques de type détecteur de mouvement, à condition que les commandes d'interrupteur soient conformes à toutes les conditions suivantes :

source: The tread depth at spiral stairways shall be in accordance with Section R311.7.10.1.
fr_ca: La profondeur des marches des escaliers en colimaçon doit être conforme à la section R311.7.10.1.

source: The tread depth shall be measured horizontally between the vertical planes of the foremost projection of adjacent treads and at a right angle to the tread’s leading edge.
fr_ca: La profondeur de pas de marche doit être mesurée horizontalement entre les plans verticaux de la saillie principale des marches adjacentes et à angle droit par rapport au bord avant de la marche.

source: The tread depth shall be not less than 10 inches (254 mm).
fr_ca: La profondeur des pas de marche ne doit pas être inférieure à 10 po [254 mm].

source: The type of construction as defined in Chapter 6.
fr_ca: Le type de construction tel que défini au chapitre 6.

source: The types of cooking appliances permitted shall be limited to ovens, cooktops, ranges, warmers and microwaves.
fr_ca: Les types d'appareils de cuisson autorisés sont limités aux fours, aux tables de cuisson, aux cuisinières, aux réchauds et aux fours à micro-ondes.

source: The types of domestic cooking appliances shall be limited to ovens, cooktops, ranges, warmers, coffee makers and microwaves.
fr_ca: Les types d'appareils de cuisson domestiques doivent être limités aux fours, aux tables de cuisson, aux cuisinières, aux chauffe-plats, aux cafetières et aux fours à micro-ondes.

source: The underside of the cooktop shall be insulated or otherwise configured to prevent burns, abrasions, or electrical shock.
fr_ca: La face inférieure de la table de cuisson doit être isolée ou configurée de manière à éviter les brûlures, les abrasions ou les chocs électriques.

source: The underside of the cooktop shall be insulated or otherwise configured to protect from burns, abrasions or electrical shock.
fr_ca: La face inférieure de la table de cuisson doit être isolée ou configurée de manière à protéger contre les brûlures, les abrasions ou les chocs électriques.

source: The unit shall be provided with a separate bathroom containing a water closet, lavatory and bathtub or shower.
fr_ca: L'unité doit être dotée d'une salle de bain séparée contenant une cabine de toilette, un lavabo et une baignoire ou une douche.

source: The unit shall be provided with a separate closet.
fr_ca: L'unité doit être dotée d'un placard séparé.

source: The unit shall have a living room of not less than 190 square feet (17.7 m2) of floor area.
fr_ca: Le logement doit avoir un salon d'au moins 190 pi2 (17,7 m2) de surface de plancher.

source: The unit system interface shall include a telephone jack capable of supporting voice and TTY communication with the public or common-use system interface.
fr_ca: L'interface système de l'unité doit comprendre une prise téléphonique capable de prendre en charge la communication vocale et ATS avec l'interface système publique ou à usage commun.

source: The uppercase letter “I” of the font shall be used to determine the allowable stroke width of all characters of a font.
fr_ca: La lettre majuscule « I » de la police doit être utilisée pour déterminer la largeur de trait admissible de tous les caractères d'une police.

source: The uppercase letter “I” of the font shall have a minimum height complying with Table 703.2.4.
fr_ca: La lettre majuscule « I » de la police doit avoir une hauteur minimale conforme au Tableau 703.2.4.

source: The use and occupancy, in accordance with the provisions of Chapter 3.
fr_ca: L’usage et l’occupation, conformément aux dispositions du chapitre 3.

source: The visible signal elements shall be 21/2 inches (64 mm) minimum between the uppermost and lowest edges of the illuminated shape measured vertically.
fr_ca: Les éléments de signalisation visible doivent être espacés d'au moins 21/2 po [64 mm] entre les bords supérieur et inférieur de la forme éclairée, mesurés verticalement.

source: The visual and raised requirements of item 1 shall be permitted to be provided by two separate signs that provide corresponding information provided one sign complies with Section 703.2 and the second sign complies with Section 703.3.
fr_ca: Les exigences visuelles et en relief du point 1 peuvent être satisfaites par deux enseignes distinctes qui fournissent les informations correspondantes, à condition qu'une enseigne soit conforme à la section 703.2 et que la deuxième enseigne soit conforme à la section 703.3.

source: The void created at the interSection of a floor/ceiling assembly and an exterior curtain wall assembly shall be permitted where protected in accordance with Section 715.4.
fr_ca: Le vide créé à l'intersection d'un ensemble plancher-plafond et d'un ensemble mur-rideau extérieur est autorisé lorsqu'il est protégé selon la section 715.4.

source: The walking surface of treads and landings of stairways shall be sloped not steeper than one unit vertical in 48 inches horizontal (2-percent slope).
fr_ca: La surface de marche des marches et des paliers des escaliers doit présenter une pente d'au plus une unité verticale sur 48 po horizontales (pente de 2 pour cent).

source: The walkline across winder treads and landings shall be concentric to the turn and parallel to the direction of travel entering and exiting the turn.
fr_ca: La ligne de foulée sur les marches balancées et les paliers doit être concentrique au virage et parallèle au sens de déplacement à l'entrée et à la sortie du virage.

source: The walkline shall be located 12 inches (305 mm) from the inside of the turn.
fr_ca: La ligne de foulée doit être située à 12 po [305 mm] de l'intérieur du virage.

source: The wall assembly incorporates multiple layers of any material, tested in tandem, that meets or exceeds Hard Body Impact Classification Level 3 as measured by the test method described in ASTM C1629/C1629M.
fr_ca: L’assemblage de murs comporte plusieurs couches de tout matériau, soumises à l’essai ensemble, qui satisfont au niveau 3 ou à un niveau supérieur de la classification de résistance aux impacts de corps durs, selon la méthode d’essai décrite dans la norme ASTM C1629/C1629M.

source: The wall assembly shall incorporate no fewer than one layer of impact-resistant panels that meet or exceed Hard Body Impact Classification Level 3 as measured by the test method described in ASTM C1629/C1629M.
fr_ca: L’assemblage de murs doit comporter au moins une couche de panneaux résistants aux chocs satisfaisant au niveau 3 ou à un niveau supérieur de la classification de résistance aux impacts de corps durs, selon la méthode d’essai décrite dans la norme ASTM C1629/C1629M.

source: The wall assembly shall incorporate no fewer than two layers of impact-resistant panels, each of which meets or exceeds Hard Body Impact Classification Level 2 as measured by the test method described in ASTM C1629/C1629M.
fr_ca: L’assemblage de murs doit comporter au moins deux couches de panneaux résistants aux chocs, chacune satisfaisant au niveau 2 ou à un niveau supérieur de la classification de résistance aux impacts de corps durs, selon la méthode d’essai décrite dans la norme ASTM C1629/C1629M.

source: The wall shall not be required to comply with this section where a backdrop with a monochromatic, low luster finish treatment is provided.
fr_ca: Le mur n'est pas tenu de se conformer à la présente section lorsqu'une toile de fond avec une finition monochromatique à faible lustre est fournie.

source: The walls and ceilings of the space are constructed as required for corridors.
fr_ca: Les murs et les plafonds de l’espace doivent être construits comme l’exigent les corridors.

source: The walls behind and surrounding the cabinetry are finished.
fr_ca: Les murs derrière et autour de l'armoire sont finis.

source: The walls behind and surrounding the countertop and cabinetry are finished.
fr_ca: Les murs derrière et autour du comptoir et des armoires sont finis.

source: The walls or partitions shall begin at a height not more than 12 inches (305 mm) from and extend not less than 60 inches (1524 mm) above the finished floor surface.
fr_ca: Les murs ou les cloisons doivent commencer à une hauteur d'au plus 12 po (305 mm) de la surface de plancher fini et se prolonger jusqu'à au moins 60 po (1524 mm) au-dessus de la surface de plancher fini.

source: The walls or partitions shall extend from the wall surface at each side of the urinal not less than 18 inches (457 mm) or to a point not less than 6 inches (152 mm) beyond the outermost front lip of the urinal measured from the finished backwall surface, whichever is greater.
fr_ca: Les murs ou cloisons doivent s’étendre à partir de la surface du mur de chaque côté de l’urinoir sur au moins 18 po (457 mm), ou jusqu’à un point situé à au moins 6 po (152 mm) au-delà de la lèvre frontale la plus extérieure de l’urinoir, mesuré à partir de la surface finie du mur arrière, selon la plus grande de ces dimensions.

source: The walls shall be of materials permitted by the building type of construction.
fr_ca: Les matériaux utilisés pour construire les murs seront ceux qui sont autorisés selon le type de construction du bâtiment.

source: The waste connection of a commercial dishwashing machine shall comply with Section 802.1.6.
fr_ca: Le raccordement des eaux usées d'un lave-vaisselle commercial doit être conforme à la section 802.1.6.

source: The waste connection of a residential dishwasher shall connect directly to a wye branch fitting on the tailpiece of the kitchen sink, directly to the dishwasher connection of a food waste disposer, or through an air break to a standpipe.
fr_ca: Le raccord d'évacuation d'un lave-vaisselle résidentiel doit être raccordé directement à un raccord en étoile sur la queue de l'évier de la cuisine, directement au raccord de lave-vaisselle d'un broyeur de déchets alimentaires, ou par l'intermédiaire d'un siphon à air à une colonne montante.

source: The waste line of a residential dishwasher shall rise and be securely fastened to the underside of the sink rim or countertop.
fr_ca: La conduite d'évacuation d'un lave-vaisselle résidentiel doit monter et être solidement fixée à la face inférieure du rebord de l'évier ou du comptoir.

source: The waste outlet shall be equipped with a watertight stopper.
fr_ca: L'évacuation doit être équipée d'un bouchon étanche.

source: The water closet shall be positioned with a wall to the rear and to one side.
fr_ca: Il doit y avoir un mur à l'arrière et sur un côté de la cabine de toilette.

source: The water closet shall comply with Section 1104.11.3.1.2.
fr_ca: La cabine de toilette doit être conforme à la section 1104.11.3.1.2.

source: The water supplied to specialty plumbing fixtures, such as pedicure chairs having an integral foot bathtub and footbaths, shall be limited to not greater than 120ºF (49ºC) by a water-temperature-limiting device that conforms to ASSE 1070/ASME A112.1070/CSA B125.70 or by a water heater complying with ASSE 1082.
fr_ca: L'eau fournie aux appareils de plomberie spécialisés, tels que les fauteuils de pédicure munis d'une baignoire pour les pieds intégrée et les pédiluves, doit être limitée à une température maximale de 120 ºF (49 ºC) par un dispositif de limitation de la température de l'eau conforme à la norme ASSE 1070/ASME A112.1070/CSA B125.70 ou par un chauffe-eau conforme à la norme ASSE 1082.

source: The water supply to a bidet shall be protected against backflow by an air gap or backflow preventer in accordance with Section 608.14.1, 608.14.2, 608.14.3, 608.14.5, 608.14.6 or 608.14.8.
fr_ca: L'alimentation en eau d'un bidet doit être protégée contre le refoulement par un espace d'air ou un dispositif anti-refoulement selon la section 608.14.1, 608.14.2, 608.14.3, 608.14.5, 608.14.6 ou 608.14.8.
